"""
Seed-данные для типов медиа.
"""

MEDIA_TYPES = [
    # ============================================
    # PRODUCTS
    # ============================================
    {
        "code": "PRODUCT_PHOTO",
        "name": "Фото товара",
        "description": "Фотография товара",
        "is_system": True,
    },
    {
        "code": "PRODUCT_DRAWING",
        "name": "Чертёж товара",
        "description": "Технический чертёж",
        "is_system": True,
    },
    
    # ============================================
    # TEMPLATES
    # ============================================
    {
        "code": "TEMPLATE_IMAGE",
        "name": "Изображение шаблона",
        "description": "Изображение шаблона",
        "is_system": True,
    },
    
    # ============================================
    # USERS
    # ============================================
    {
        "code": "USER_AVATAR",
        "name": "Аватарка пользователя",
        "description": "Фото профиля",
        "is_system": True,
    },
    {
        "code": "COMPANY_LOGO",
        "name": "Лого компании",
        "description": "Логотип компании",
        "is_system": True,
    },
]